In [1]:
import pandas as pd

In [3]:
# geting data form the websit

user = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep = '|')

In [4]:
# see first 5 rows from the data 
user.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [5]:
# see last 5 rows from the data 
user.tail(5)

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [7]:
# no of Coloumn in the data set 
print(user.shape[0])
print(user.shape[1])

943
5

In [8]:
# print the name of the col
user.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [10]:
#How the  data is indexed 
user.index

RangeIndex(start=0, stop=943, step=1)

In [12]:
#data type of each column 
user.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [13]:
#print only occupation column

user.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [14]:
# How many occupation are their in occupation col
user.occupation.nunique()

21

In [19]:
# Disply the ocupation wise count 
user.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [25]:
#What is most frequent occupation 

user.occupation.value_counts().head(1).index[0]

'student'

In [27]:
#Summerize the data frame 
user.describe()  # note only the numeric column are included

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [28]:
# to include all the column 

user.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

In [32]:
# User age mean 
print(user.age.mean())
print(round(user.age.mean()))

34.05196182396607
34

In [34]:
# What is the age with least occurance ?
user.age.value_counts().tail(10)

58    3
64    2
68    2
69    2
62    2
11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64